app/Controllers/Register.php

    public function save()
    {
        helper(['form']);
        $rules = [
            'name'          => 'required|min_length[6]|max_length[200]',
            'email'         => 'required|min_length[6]|max_length[200]|valid_email|is_unique[users.email]',
            'password'      => 'required|min_length[6]|max_length[200]',
            'confpassword'  => 'matches[password]'
        ];

        if($this->validate($rules)){
            $model  = new UserModel();
            $data   = [
                'name' => $this->request->getVar('name'),
                'email' => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT)
            ];
            $model->save($data);
---
INSERT INTO `users` (`name`, `email`, `password`) VALUES ('Rifandi Kurniansyah Hidayat', 'rifandikurniansyah@gmail.com', '$2y$10$FcoVSycwN3YVlQHov34NxeE0ecoaEHfqhG8CFuM2KJ8LHy1HwNyQ6')